adafruit/Adafruit_nRF52_Arduino/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.debug=Debug Mode

feather52.name=Adafruit Bluefruit nRF52 Feather

feather52.vid.0=0x10C4
feather52.pid.0=0xEA60

feather52.upload.tool=nrfutil
feather52.upload.protocol=nrfutil
feather52.upload.interface=serial
feather52.upload.target=nrf52
feather52.upload.maximum_size=167936
feather52.upload.use_1200bps_touch=false
feather52.upload.wait_for_upload_port=false
feather52.upload.native_usb=false

feather52.bootloader.tool=nrfjprog

feather52.build.mcu=cortex-m4
feather52.build.f_cpu=16000000
feather52.build.board=FEATHER52
feather52.build.core=nRF5
feather52.build.variant=feather52
feather52.build.variant_system_lib=
feather52.build.extra_flags=-DNRF52 -DS132 -DNRF51_S132
feather52.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
feather52.build.ldscript=feather52_s132.ld

feather52.build.nrfutil=nrfutil
feather52.build.nrfutil.windows={runtime.platform.path}/tools/nrfutil-0.5.2/binaries/win32/nrfutil.exe
feather52.build.nrfutil.macosx=/usr/local/bin/nrfutil

feather52.menu.debug.l0=Level 0 (Release)
feather52.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0

feather52.menu.debug.l1=Level 1 (Error Message)
feather52.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1

feather52.menu.debug.l2=Level 2 (Full Debug)
feather52.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
